Revit 2027 API
PlasticVinyl Class
 A static class that provides access to the property names that appear in the PlasticVinyl visual asset schema.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Visual.PlasticVinyl
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static class PlasticVinyl
Public NotInheritable Class PlasticVinyl
public ref class PlasticVinyl abstract sealed
[<AbstractClassAttribute>]
[<SealedAttribute>]
type PlasticVinyl = class end
The PlasticVinyl type exposes the following members.
Properties
Name | Description
CommonTintColor |  The property labeled "Tint Color" from the "PlasticVinyl" schema.
CommonTintToggle |  The property labeled "Tint" from the "PlasticVinyl" schema.
PlasticvinylApplication |  The property labeled "Finish" from the "PlasticVinyl" schema.
PlasticvinylBump |  The property labeled "Finish Bumps" from the "PlasticVinyl" schema.
PlasticvinylBumpAmount |  The property labeled "Amount" from the "PlasticVinyl" schema.
PlasticvinylBumpMap |  The property labeled "Image" from the "PlasticVinyl" schema.
PlasticvinylColor |  The property labeled "Color" from the "PlasticVinyl" schema.
PlasticvinylColorByObject |  The property labeled "Color By Object" from the "PlasticVinyl" schema.
PlasticvinylPattern |  The property labeled "Relief Pattern" from the "PlasticVinyl" schema.
PlasticvinylPatternAmount |  The property labeled "Amount" from the "PlasticVinyl" schema.
PlasticvinylPatternMap |  The property labeled "Image" from the "PlasticVinyl" schema.
PlasticvinylType |  The property labeled "Type" from the "PlasticVinyl" schema.
Top
See Also
Reference
Autodesk.Revit.DB.Visual Namespace